english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* sort
:PROPERTIES:
:EXPORT_FILE_NAME: sort.md
:END:
排序的类型
** 语义
*** 类型
What sort of shampoo do you use?
*** 有点
I sort of like him, but I don't know why.
*** 将...分类
The eggs are sorted according to size.
** 短语
*** it takes all sorts
He goes climbing up cliffs without ropes or anything? Oh well, it takes all sorts.

https://youglish.com/getbyid/526529/it%20takes%20all%20sorts/english
*** out of sorts
Louise went back to work feeling rather out of sorts.

https://youglish.com/getbyid/25882860/out%20of%20sorts/english
*** sort out
**** 整理
We need to sort out our camping gear before we go away.

https://youglish.com/getbyid/15181192/sort%20out/english
**** 挑出
I've sorted out the papers that can be thrown away.
**** 解决
She went to a psychiatrist to try to sort out her problems.

https://youglish.com/getbyid/78003096/sort%20out/english
**** 安排好
Have you sorted out where you're going to live yet?

https://youglish.com/getbyid/77877467/sort%20out/english
**** 自行解决
Our financial problems should sort themselves out in a week or two.

https://youglish.com/getbyid/68621049/sort%20out/english
**** 收拾
If he bothers you again, I'll sort him out.

https://youglish.com/getbyid/120532724/sort%20him%20out/english
*** sort through
Vicky sat down and sorted through the files.

https://youglish.com/getbyid/15181183/sort%20through/english
*** all sorts of
It was used by all sorts of people.

https://youglish.com/getbyid/19777580/all%20sorts%20of/english
